#!usr/bin/env python
#-*- coding:utf-8 -*-

# author:yangva
# datetime:2017/12/7 0007 13:16

china_map_dict={
    '吉林':{
            '长春':{'朝阳区':{},'南关区':{},'宽城区':{},'二道区':{},'绿园区':{},'双阳区':{},'德惠市':{},'九台市':{},'榆树市':{},'农安县':{}},
            '吉林市':{'船营区':{},'昌邑区':{},'龙潭区':{},'丰满区':{},'蛟河市':{},'桦甸市':{},'舒兰市':{},'磐石市':{},'永吉县':{}},
            '四平':{'铁西区':{},'铁东区':{},'公主岭市':{},'双辽市':{},'梨树县':{},'伊通满族自治县':{}},
            '辽源':{'龙山区':{},'西安区':{},'东丰县':{},'东辽县':{}},
            '通化':{'东昌区':{},'二道江区':{},'梅河口市':{},'集安市':{},'通化县':{},'辉南县':{},'柳河县':{}},
            '白山':{'浑江区':{},'江源区':{},'临江市':{},'抚松县':{},'靖宇县':{},'长白朝鲜族自治县':{}},
            '松原':{'宁江区':{},'长岭县':{},'乾安县':{},'扶余县':{},'前郭尔罗斯蒙古族自治县':{}},
            '白城':{'洮北区':{},'洮南市':{},'大安市':{},'镇赉县':{},'通榆县':{}},
            '延边州':{'延吉市':{},'图们市':{},'敦化市':{},'和龙市':{},'珲春市':{},'龙井市':{},'汪清县':{},'安图县':{}},
            '长白山管委会':{}
            },
    '四川':{
        '成都':{'锦江区':{},'青羊区':{},'金牛区':{},'武侯区':{},'成华区':{},'青白江区':{},'龙泉驿区':{},'新都区':{},'温江区':{},'金堂县':{},'双流县':{},'郫县':{},'大邑县':{},'蒲江县':{},'新津县':{},'都江堰市':{},'彭州市':{},'崇州市':{},'邛崃市':{}},
        '自贡':{'自流井区':{},'贡井区':{},'大安区':{},'滩区':{},'荣县':{},'富顺县':{}},
        '攀枝花':{'东区':{},'西区':{},'仁和区':{},'米易县':{},'盐边县':{}},
        '泸州':{'江阳区':{},'龙马潭区':{},'纳溪区':{},'泸县':{},'合江县':{},'叙永县':{},'古蔺县':{}},
        '德阳':{'旌阳区':{},'广汉市':{},'什邡市':{},'绵竹市':{},'中江县':{},'罗江县':{}},
        '绵阳':{'涪城区':{},'游仙区':{},'梓潼县':{},'三台县':{},'盐亭县':{},'安县':{},'平武县':{},'江油市':{},'北川羌族自治县':{}},
        '广元':{'利州区':{},'昭化区':{},'朝天区':{},'旺苍县':{},'青川县':{},'剑阁县':{},'苍溪县':{}},
        '遂宁':{'船山区':{},'安居区':{},'射洪县':{},'蓬溪县':{},'大英县':{}},
        '内江':{'市中区':{},'东兴区':{},'资中县':{},'隆昌县':{},'威远县':{}},
        '乐山':{'市中区':{},'沙湾区':{},'五通桥区':{},'金口河区':{},'犍为县':{},'井研县':{},'夹江县':{},'沐川县':{},'峨眉山市':{},'峨边彝族自治县':{},'马边彝族自治县':{}},
        '南充':{'顺庆区':{},'高坪区':{},'嘉陵区':{},'西充县':{},'南部县':{},'蓬安县':{},'营山县':{},'仪陇县':{},'阆中市':{}},
        '眉山':{'东坡区':{},'彭山区':{},'仁寿县':{},'丹棱县':{},'青神县':{},'洪雅县':{}},
        '宜宾':{'翠屏区':{},'南溪区':{},'宜宾县':{},'江安县':{},'长宁县':{},'高县':{},'筠连县':{},'珙县':{},'兴文县':{},'屏山县':{}},
        '广安':{'广安区':{},'前锋区':{},'邻水县':{},'武胜县':{},'岳池县':{},'华蓥市':{}},
        '达州':{'通川区':{},'达川区':{},'宣汉县':{},'开江县':{},'大竹县':{},'渠县':{},'万源市':{}},
        '雅安':{'雨城区':{},'名山区':{},'荥经县':{},'汉源县':{},'石棉县':{},'天全县':{},'芦山县':{},'宝兴县':{}},
        '巴中':{'巴州区':{},'恩阳区':{},'平昌县':{},'通江县':{},'南江县':{}},
        '资阳':{'雁江区':{},'安岳县':{},'乐至县':{},'简阳市':{}},
        '阿坝藏族羌族自治州':{'马尔康县':{},'金川县':{},'小金县':{},'阿坝县':{},'若尔盖县':{},'红原县':{},'壤塘县':{},'汶川县':{},'理县':{},'茂县':{},'松潘县':{},'九寨沟县':{},'黑水县':{}},
        '甘孜藏族自治州':{'康定县':{},'泸定县':{},'九龙县':{},'道孚县':{},'炉霍县':{},'甘孜县':{},'新龙县':{},'德格县':{},'白玉县':{},'石渠县':{},'色达县':{},'理塘县':{},'巴塘县':{},'乡城县':{},'稻城县':{},'得荣县':{}},
        '凉山彝族自治州':{'西昌市':{},'德昌县':{},'会理县':{},'会东县':{},'宁南县':{},'普格县':{},'布拖县':{},'昭觉县':{},'金阳县':{},'雷波县':{},'美姑县':{},'甘洛县':{},'越西县':{},'喜德县':{},'冕宁县':{},'盐源县':{},'木里藏族自治县':{}}
        }

    # '广东':{
    #         '广州':
    #         '韶关':
    #         '深圳':
    #         '珠海':
    #         '汕头':
    #         '佛山':
    #         '江门':
    #         '湛江':
    #         '茂名':
    #         '肇庆':
    #         '惠州':
    #         '梅州':
    #         '汕尾':
    #         '河源':
    #         '阳江':
    #         '清远':
    #         '东莞':
    #         '中山':
    #         '潮州':
    #         '揭阳':
    #         '云浮':
    #         },
    # '湖北':{
    #         '武汉':
    #         '黄石':
    #         '十堰':
    #         '宜昌':
    #         '襄阳':
    #         '鄂州':
    #         '荆门':
    #         '孝感':
    #         '荆州':
    #         '黄冈':
    #         '咸宁':
    #         '随州':
    #         '恩施':
    #         '公安':
    #         '武穴':
    #         '天门':
    #         '仙桃':
    #         '潜江':
    #         '宜城':
    #         '神农架':
    #         },
    # '陕西':{
    #         '西安':
    #         '铜川':
    #         '宝鸡':
    #         '咸阳':
    #         '渭南':
    #         '延安':
    #         '汉中':
    #         '榆林':
    #         '安康':
    #         '商洛':
    #         '兴平':
    #         '杨凌':
    #         '西咸新区':
    #
    #         }
    # '辽宁':{
    #         '大连':
    #         '沈阳':
    #         '鞍山':
    #         '抚顺':
    #         '本溪':
    #         '丹东':
    #         '锦州':
    #         '营口':
    #         '阜新':
    #         '辽阳':
    #         '盘锦':
    #         '铁岭':
    #         '朝阳':
    #         '葫芦岛':
    #         '兴城':
    #         '海城':
    #         '昌图':
    #         '开原':
    #         '东港':
    #         },
    # '江苏':{
    #         '南京':
    #         '苏州':
    #         '昆山':
    #         '常熟':
    #         '张家港':
    #         '无锡':
    #         '徐州':
    #         '常州':
    #         '南通':
    #         '连云港':
    #         '淮安':
    #         '盐城':
    #         '扬州':
    #         '镇江':
    #         '泰州':
    #         '宿迁':
    #         '太仓市':
    #         },
    # '山东':{
    #         '济南':
    #         '青岛':
    #         '淄博':
    #         '枣庄':
    #         '东营':
    #         '烟台':
    #         '潍坊':
    #         '济宁':
    #         '泰安':
    #         '威海':
    #         '日照':
    #         '莱芜':
    #         '临沂':
    #         '德州':
    #         '聊城':
    #         '滨州':
    #         '菏泽':
    #
    #         },
    # '浙江':{
    #         '杭州':
    #         '宁波':
    #         '温州':
    #         '嘉兴':
    #         '湖州':
    #         '绍兴':
    #         '金华':
    #         '衢州':
    #         '舟山':
    #         '台州':
    #         '丽水':
    #         '方家山':
    #         },
    # '广西':{
    #         '南宁':
    #         '柳州':
    #         '桂林':
    #         '梧州':
    #         '北海':
    #         '防城港':
    #         '钦州':
    #         '贵港':
    #         '玉林':
    #         '百色':
    #         '贺州':
    #         '河池':
    #         '来宾':
    #         '崇左':
    #         },
    # '安徽':{
    #         '合肥':
    #         '芜湖':
    #         '蚌埠':
    #         '淮南':
    #         '马鞍山':
    #         '淮北':
    #         '铜陵':
    #         '安庆':
    #         '黄山':
    #         '滁州':
    #         '阜阳':
    #         '宿州':
    #         '六安':
    #         '亳州':
    #         '池州':
    #         '宣城':
    #         '凤阳':
    #         '广德':
    #         '宿松':
    #         },
    # '河北':{
    #         '石家庄':
    #         '唐山':
    #         '秦皇岛':
    #         '邯郸':
    #         '邢台':
    #         '保定':
    #         '张家口':
    #         '承德':
    #         '沧州':
    #         '廊坊':
    #         '衡水':
    #         '遵化':
    #         },
    # '山西':{
    #         '太原':
    #         '大同':
    #         '阳泉':
    #         '长治':
    #         '晋城':
    #         '朔州':
    #         '晋中':
    #         '运城':
    #         '忻州':
    #         '临汾':
    #         '吕梁':
    #         '永济市':
    #         },
    # '内蒙':{
    #         '呼和浩特':
    #         '包头':
    #         '乌海':
    #         '赤峰':
    #         '通辽':
    #         '鄂尔多斯':
    #         '呼伦贝尔':
    #         '兴安盟':
    #         '锡林郭勒盟':
    #         '乌兰察布':
    #         '巴彦淖尔':
    #         '阿拉善盟':
    #         '乌审旗':
    #         '满洲里':
    #         },
    # '黑龙江':{
    #         '哈尔滨':
    #         '齐齐哈尔':
    #         '鸡西':
    #         '鹤岗':
    #         '双鸭山':
    #         '大庆':
    #         '伊春':
    #         '佳木斯':
    #         '七台河':
    #         '牡丹江':
    #         '黑河':
    #         '绥化':
    #         '大兴安岭':
    #         '安达':
    #         '双城':
    #         '尚志':
    #         '绥芬河':
    #         '肇东市':
    #         },
    # '福建':{
    #         '福州':
    #         '厦门':
    #         '莆田':
    #         '三明':
    #         '泉州':
    #         '漳州':
    #         '南平':
    #         '龙岩':
    #         '宁德':
    #         },
    # '江西':{
    #         '南昌':
    #         '景德镇':
    #         '萍乡':
    #         '九江':
    #         '新余':
    #         '鹰潭':
    #         '赣州':
    #         '吉安':
    #         '宜春':
    #         '抚州':
    #         '上饶':
    #         },
    # '河南':{
    #         '郑州':
    #         '开封':
    #         '洛阳':
    #         '平顶山':
    #         '安阳':
    #         '鹤壁':
    #         '新乡':
    #         '焦作':
    #         '濮阳':
    #         '许昌':
    #         '漯河':
    #         '三门峡':
    #         '南阳':
    #         '商丘':
    #         '信阳':
    #         '周口':
    #         '驻马店':
    #         '济源':
    #         '西平':
    #         },
    # '湖南':{
    #         '长沙':
    #         '株洲':
    #         '湘潭':
    #         '衡阳':
    #         '邵阳':
    #         '岳阳':
    #         '常德':
    #         '张家界':
    #         '益阳':
    #         '郴州':
    #         '永州':
    #         '怀化':
    #         '娄底':
    #         '湘西':
    #         },
    # '海南':{
    #         '海口':
    #         '三亚洋浦市/洋浦经济开发区':
    #         '琼海':
    #         '儋州':
    #         '五指山':
    #         '文昌':
    #         '万宁':
    #         '东方':
    #         '定安':
    #         '屯昌':
    #         '澄迈':
    #         '临高':
    #         '琼中':
    #         '保亭':
    #         '白沙':
    #         '昌江':
    #         '乐东':
    #         '陵水':
    #         },
    # '贵州':{
    #         '贵阳':
    #         '六盘水':
    #         '遵义':
    #         '安顺':
    #         '铜仁':
    #         '黔西南':
    #         '毕节':
    #         '黔东南':
    #         '黔南':
    #         },
    # '云南':{
    #         '昆明':
    #         '曲靖':
    #         '玉溪':
    #         '保山':
    #         '昭通':
    #         '楚雄':
    #         '红河':
    #         '文山':
    #         '西双版纳':
    #         '大理':
    #         '德宏':
    #         '丽江':
    #         '怒江':
    #         '迪庆':
    #         '临沧':
    #         '普洱':
    #
    #         },
    # '西藏':{
    #         '拉萨':
    #         '昌都':
    #         '山南':
    #         '日喀则':
    #         '那曲':
    #         '阿里':
    #         '林芝':
    #         },
    # '甘肃':{
    #         '兰州':
    #         '嘉峪关':
    #         '金昌':
    #         '白银':
    #         '天水':
    #         '武威':
    #         '张掖':
    #         '平凉':
    #         '酒泉':
    #         '庆阳':
    #         '定西':
    #         '陇南':
    #         '临夏':
    #         '甘南':
    #         },
    # '青海':{
    #         '西宁':
    #         '海东':
    #         '海北':
    #         '黄南':
    #         '海南州':
    #         '果洛':
    #         '玉树':
    #         '海西':
    #         },
    # '宁夏':{
    #         '银川':
    #         '石嘴山':
    #         '吴忠':
    #         '固原':
    #         '中卫':
    #         },
    # '新疆':{
    #         乌鲁木齐':
    #         '克拉玛依':
    #         '吐鲁番':
    #         '哈密':
    #         '昌吉':
    #         '博尔塔拉':
    #         '巴音郭楞':
    #         '阿克苏':
    #         '克孜勒苏':
    #         '喀什':
    #         '和田':
    #         '伊犁':
    #         '塔城':
    #         '阿勒泰':
    #         '石河子':
    #         '奎屯市':
    #         '乌苏':
    #         '阿拉尔':
    #         '图木舒克':
    #         '五家渠':
    #         '北屯市':
    #         }
}

'个人想法，最初版本'

# print('欢迎访问中国地区查询平台！')
# print('注意：\n1.输入【back】可返回上一级菜单,输入【quit】可以随时退出。\n2.只有在省级才能直接退出，市和县区下不能直接退出。\n3.省级不能再返回上一级，县区不能直接返回到省级。\n')
#
# while True: #第一级省
#     print('中国各个省：')
#     for i in china_map_dict.keys():    #打印中国的各个省展示
#         print(i)
#
#     print() #单独打印一行空行，和下文隔开，美观
#     keys = input('请输入相关省下的市名进行下一级查询，或者输入【back】或【quit】：>>>')
#     if keys in china_map_dict.keys():
#         cont = keys #暂存变量，方便返回上一级使用
#         temp = china_map_dict[keys]  #暂存变量，方便迭代进入字典内层
#         print('%s省下各个市：\n'%keys)
#
#         while True:  #第二级市
#             for i in temp:  #进入省下，打印省下各个市
#                 print(i,end='\n')
#             print()
#             keys = input('请输入【%s】省下的市名进行下一级查询，或者输入【back】：>>>'%cont)
#             if keys in temp.keys():
#                 cont2 = keys #暂存变量，方便返回上一级使用
#                 temp2 = temp[keys] #缓存变量，方便迭代进入字典内层
#                 print('%s市下各个县区：\n'%keys)
#                 for i in temp2: #进入市下，打印市下各个县区
#                     print(i,end='\n')
#                 print()
#
#
#                 while True: #第三级县区
#                     keys = input('请输入【%s】市下的县区名进行下一级查询，或者输入【back】：>>>'%cont2)
#                     if keys in temp2:
#                         print('【%s】省【%s】市存在县区名为【%s】的地方'%(cont,cont2,keys))
#                     elif keys in ['back','quit']:
#                         print('返回上级\n')
#                         break  #跳出本层循环，进入市(二级)
#                     else:
#                         print('输入有误，【%s】省【%s】市不存在名为【%s】的县区名，请重新输入'%(cont,cont2,keys))
#
#             elif keys in ['back','quit']:
#                 print('已返回上级\n')
#                 break  #跳出本层循环，进入省(一级)
#             else:
#                 print('输入有误，【%s】省不存在名为【%s】的市名，请重新输入'%(cont,keys))
#     elif keys == 'back':
#         print('抱歉，您已经在省级下，不能再退出到上一级啦，你可以输入【quit】退出或输入省级名进入下一级')
#     elif keys == 'quit':
#         print('您已输入quit,正在退出')
#         break # 跳出本层循环，退出
#     else:
#         print('输入有误，中国不存在名为【%s】的省名，请重新输入'%keys)
#
# print('欢迎使用，再见！！')


'使用标志位'

# back_flags = False
# quit_flags = False
#
# while not back_flags and not quit_flags: #第一层
#     for key in china_map_dict:
#         print(key)
#     choice = input('1>>:').strip()
#     if choice == 'quit':
#         quit_flags = True
#     if choice in china_map_dict:
#         while not back_flags and not quit_flags: #第二层
#             for key2 in china_map_dict[choice]:
#                 print(key2)
#             choice2 = input('2>>').strip()
#             if choice2 == 'quit':
#                 quit_flags = True
#             if choice2 in china_map_dict[choice]:
#                 while not back_flags and not quit_flags: #第三层
#                     for key3 in china_map_dict[choice][choice2]:
#                         print(key3)
#                     choice3 = input('3>>:').strip()
#                     print('last leval')
#                     if choice3 == 'back':
#                         back_flags = True
#                     if choice3 == 'quit':
#                         quit_flags = True
#                 else:
#                     back_flags = False
#         else:
#             back_flags = False
# else:
#     back_flags = False

'高效版本'
'由于以上版本功能虽然可以实现，但是都不够好，代码重复性太高，下面的代码则是不同过用函数也可以达到要求'
current_leval = china_map_dict #实现动态循环
parent_list = [] #把所有列表父级放进列表
while True:
    for key in current_leval:
        print(key)
    choice = input('>>>：').strip()
    if len(choice) == 0:continue
    if choice in current_leval:
        parent_list.append(current_leval)
        current_leval = current_leval[choice] #进入子级
    elif choice == 'back':
        if parent_list:
            current_leval=parent_list.pop() #取出父级（上一级）
    elif choice == 'quit':
        print('程序已退出')
        break
    else:
        print('无选项【%s】'%choice)
